mold_ver_001/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    movingWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3200;
        startFace       687582;
    }
    fixedWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          9600;
        startFace       690782;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          7012;
        startFace       700382;
    }
    mold
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          47594;
        startFace       707394;
    }
)

// ************************************************************************* //
